{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "b94aa4e4",
   "metadata": {},
   "source": [
    "# Домашнее задание: Коллекции. Упрощенные задания"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "34f757e6",
   "metadata": {},
   "source": [
    "## Задание 1\n",
    "\n",
    "Написать программу, которая получает на вход строку и возвращает словарь, где:\n",
    "- ключи — символы из этой строки;\n",
    "- значения — количество раз, сколько каждый символ встречается."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "ef0949a7",
   "metadata": {},
   "outputs": [],
   "source": [
    "user_input = input('Введите строку: ')\n",
    "\n",
    "result = {}\n",
    "for char in user_input:\n",
    "    if char.isalnum():\n",
    "        result[char] = result.get(char, 0) + 1\n",
    "print(f'Словарь для строки \"{user_input}\": {result}')"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "096e3089",
   "metadata": {},
   "source": [
    "## Задание 2\n",
    "\n",
    "Дана строка текста (или введённая через консоль). Программа должна вернуть новую строку, в которой порядок слов будет обратным.\n",
    "Пример:\n",
    "\"Python is really cool\" → \"cool really is Python\".\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "844b16ef",
   "metadata": {},
   "outputs": [],
   "source": [
    "user_input = input('Введите строку: ')\n",
    "\n",
    "words = user_input.split()\n",
    "result = ' '.join(words[::-1])\n",
    "print(f'\"{user_input}\" -> \"{result}\"')"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c1813463",
   "metadata": {},
   "source": [
    "## Задание 3\n",
    "\n",
    "Написать программу, которая удаляет из списка все дубликаты, сохранив исходный порядок элементов.\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "3be4ad3e",
   "metadata": {},
   "outputs": [],
   "source": [
    "user_input = input(\"Введите список элементов через пробел: \")\n",
    "\n",
    "words = user_input.split()\n",
    "result = []\n",
    "keys = set()\n",
    "for word in words:\n",
    "    if word not in keys:\n",
    "        keys.add(word)\n",
    "        result.append(word)\n",
    "print(result)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "22073c10",
   "metadata": {},
   "source": [
    "## Задание 4\n",
    "\n",
    "Даны три (или больше) списка с объектами. Программа должна создать новый список, содержащий все уникальные элементы — каждый объект встречается только один раз.\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "c2e50709",
   "metadata": {},
   "outputs": [],
   "source": [
    "lists = [\n",
    "    [1, 2, 3, 4, 5],\n",
    "    [2, 2, 3, 'ab', 'c'],\n",
    "    ['a', 0, 1, 'c', 'b']\n",
    "]\n",
    "\n",
    "result_set = set()\n",
    "for ls in lists:\n",
    "    result_set = result_set.union(ls)\n",
    "result = list(result_set)\n",
    "print(result)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "de842e24",
   "metadata": {},
   "source": [
    "## Задание 5\n",
    "\n",
    "Дана строка текста (или введённая через консоль). Программа должна вернуть словарь с четырьмя ключами:\n",
    "- \"гласные\",\n",
    "- \"согласные\",\n",
    "- \"цифры\",\n",
    "- \"пунктуация\".\n",
    "\n",
    "Значения — количество символов каждого типа в строке.\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "3c8cc12d",
   "metadata": {},
   "outputs": [],
   "source": [
    "user_input = input('Введите строку: ').strip()\n",
    "\n",
    "VOWELS = 'Гласные'\n",
    "CONSONANTS = 'Согласные'\n",
    "DIGITS = 'Цифры'\n",
    "PUNCTUATIONS = 'Знаки пунктуации'\n",
    "\n",
    "result = {\n",
    "    VOWELS: 0,\n",
    "    CONSONANTS: 0,\n",
    "    DIGITS: 0,\n",
    "    PUNCTUATIONS: 0,\n",
    "}\n",
    "\n",
    "vowel_set = {'а', 'е', 'ё', 'и', 'о', 'у', 'ы', 'э', 'ю', 'я'}\n",
    "punctuation_set = {'.', ',', ';', ':', '!', '?', '-', '—', '«', '»', '(', ')', '[', ']', '{', '}'}\n",
    "\n",
    "result[PUNCTUATIONS] += user_input.count('...')\n",
    "\n",
    "for char in user_input.replace('...', ''):\n",
    "    if char.isdecimal():\n",
    "        result[DIGITS] += 1\n",
    "    elif char.isalpha() and char.lower() in vowel_set:\n",
    "        result[VOWELS] += 1\n",
    "    elif char.isalpha():\n",
    "        result[CONSONANTS] += 1\n",
    "    elif char in punctuation_set:\n",
    "        result [PUNCTUATIONS] += 1\n",
    "\n",
    "for key, value in result.items():\n",
    "    print(f'{key}: {value}')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "48c16aab",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "base",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.13.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
